import Header from "./components/Header";
import Footer from "./components/Footer";

export default function App() {
  return (
    <>
      <Header text="Speech - 40x" />
      <main className="container">
        <section>
          <div className="section-container space-y-6 text-xl font-bold">
            <p>
              সম্মানিত অধ্যক্ষ মহোদয়, প্রিয় শিক্ষকবৃন্দ, শ্রদ্ধেয় বড় ভাইবোন
              এবং আমার প্রিয় সহপাঠীগণ,
              <br />
              আসসালামু আলাইকুম।
            </p>
            <p>
              শুরুতেই আমি ধন্যবাদ জানাতে চাই আমাকে এখানে কথা বলার সুযোগ দেয়ার
              জন্য। আমি নুরুজ্জামান, হিসাববিজ্ঞান বিভাগ - ১ম বর্ষ, সরকারি
              এডওয়ার্ড কলেজ। আমি আপনাদের সামনে জুলাই গণঅভ্যুত্থান নিয়ে কিছু কথা
              বলবো।
            </p>
            <hr />
            <p>
              ইতিহাসের কিছু সময় আছে যা শুধু বইয়ের পাতায় নয়—মানুষের হৃদয়ে
              চিরদিন বেঁচে থাকে। ২০২৪ সালের জুলাই মাস ছিল ঠিক তেমনই এক সময়, যখন
              একটি ন্যায্য দাবির আন্দোলন রূপ নেয় সারাদেশব্যাপী গণ-অভ্যুত্থানে।
            </p>
            <p>
              শিক্ষার্থীদের কণ্ঠে শুরু হওয়া এই আন্দোলন ছড়িয়ে পড়েছিল
              সর্বত্র—গ্রাম থেকে শহর, তরুণ থেকে প্রবীণ, নারী থেকে শিশু—সবাই মিলে
              উচ্চারণ করেছিল একটাই কথা: “আমরা ন্যায় চাই, আমরা অধিকার চাই।”
            </p>
            <p>
              কঠিন সময় এসেছিল—জীবন গেছে, রক্ত ঝরেছে, যোগাযোগ বিচ্ছিন্ন হয়েছে।
              কিন্তু জনগণের ঐক্য, সাহস ও সত্যের শক্তি কোনো দেয়ালেই আটকানো
              যায়নি।
            </p>
            <p>
              জুলাইয়ের এই অভ্যুত্থান আমাদের তিনটি শিক্ষা দিয়ে গেছে—
              <br />
              ১. ঐক্যই সবচেয়ে বড় শক্তি।
              <br />
              ২. ন্যায়ের পথে হাঁটা কখনো অপরাধ নয়।
              <br />
              ৩. ত্যাগ বৃথা যায় না—এটি নতুন ভোরের পথ খুলে দেয়।
            </p>
            <p>
              বন্ধুগণ, আমরা যারা আজ শান্ত পরিবেশে কথা বলছি—এটি এসেছে অনেকের
              ত্যাগের বিনিময়ে। তাই অন্যায় দেখলে চুপ থাকা নয়, বরং সাহসের সাথে
              সত্যের পাশে দাঁড়ানোই আমাদের দায়িত্ব।
            </p>
            <p>
              শেষে বলি— “২০২৪ সালের জুলাই প্রমাণ করেছে— যখন মানুষ জেগে ওঠে, তখন
              অন্যায়ের রাত যতই দীর্ঘ হোক, নতুন ভোর অবশ্যম্ভাবী।”
            </p>
            <p>ধন্যবাদ সবাইকে।</p>
          </div>
        </section>
      </main>
      <Footer name="Nuru" />
    </>
  );
}
